advanced/frontend/controllers/LoginController.php

UPDATE `study_admin` SET `admin_time`='1487246931', `admin_ip`='127.0.0.1' WHERE `admin_id`='1'
---
    public function actionCheck()
    {
      $session = Yii::$app->session;   //开启session
    	$request=Yii::$app->request;    //调用request类
    	if($request->isPost)
    	{
            $post=$request->post();    //接受数据
            $code = $session['code'];     //验证码
            $name = $post['name'];         //用户名
            $pwd = $post['password'];     //密码
            $nowCode = $post['code'];    //获取验证码
            // $pwd = md5($post['password']);
           // $pwd = Yii::$app->security->generatePasswordHash($post['password']);
            if($code!=$nowCode)    //判断验证码
            {
                 echo "<script>alert('验证码错误');location.href='?r=login/login'</script>";
            }else
            {
                $res = StudyAdmin::checkAdmin($name,$pwd); //调用管理员model
                if($res!='no')
                {
                  $time= date('Y-m-d H:i:s',time());     //当前时间
                  $time = strtotime($time);          //转化为时间戳
                  $ip = $_SERVER['REMOTE_ADDR'];     //获取登陆者IP地址
                  $db = \Yii::$app->db->createCommand();      //开启DB类
                  $reg = $db->update('study_admin' , ['admin_time'=>$time,'admin_ip'=>$ip], ['admin_id'=>$res['admin_id']])->execute();//执行管理员登录修改信息